Tekla Open API Reference for Tekla Structures 2025
DistanceList.ToString Method
Overload List
Name | Description
ToString()
 Returns the string representation of the distance list.
 (Overrides ValueType.ToString().)
ToString(IFormatProvider)
 Returns the string representation of the distance list.
ToString(String, IFormatProvider)
 Returns the string representation of the distance list.
ToString(String, IFormatProvider, Distance.UnitType)
 Returns the string representation of the distance list.
Top
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace